{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ec6" }, "course_description" : [ "Successful healthcare delivery requires exceptional communication skills in a huge variety of contexts, from supervising juniors to successful surgery and from liaising with management to influencing a department of people. The Advanced Communication Excellence eLearning programme is a designed to take your communication skills to the highest possible levels across the full diversity of contexts, both professional to professional and professional to patient.", "Commencing with the baseline principles as a backbone to communication excellence, it then provides an in-depth understanding of people - the key to optimising your impact in so many scenarios. There's a strong focus on practical application, covering many scenarios from supervising juniors to handling difficult patient interactions. This dynamic and comprehensive eLearning programme blends the knowledge and insight of years of classroom training with a specific eLearning focus, utilising illustrative videos and challenging exercises to make sure that you get the very best from our training.", " " ], "title" : [ "Advanced Communication Excellence " ], "url" : "http://medmeetings.co.ukelearning/all/advanced_communication_excellence_", "course_duration" : [ "10 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ec7" }, "course_description" : [ "Aimed at Clinical Directors, Clinical Service Leads, Senior Consultants, GP Principals, Service Directors & Matrons with a responsibility for leading their service successfully in today's challenging times." ], "next_date" : [ "25th May 2016, London" ], "title" : [ "Applied Leadership Masterclass " ], "url" : "http://medmeetings.co.uktraining/all/Applied-Leadership-Masterclass-for-Service-Leaders", "course_duration" : [ "2 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ec8" }, "course_description" : [ "There's a world of difference between managing patients and managing services and yet many clinical managers and leaders find themselves in charge of large numbers of people and huge budgets without formal training or development. Applied Management Masterclass is without doubt the most comprehensive, respected and practical programme available for consultants, other doctors and healthcare professionals. Built around robust frameworks, it comes with a huge degree of additional support." ], "next_date" : [ "14th July 2016, Birmingham" ], "title" : [ "Applied Management Masterclass " ], "url" : "http://medmeetings.co.uktraining/all/applied-management-masterclass", "course_duration" : [ "2 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ec9" }, "course_description" : [ "Assertiveness without Aggression is probably the most comprehensive, practical programme available, designed to help consultants, other doctors and healthcare professionals adopt the right behaviour, communication and approach to have the right impact. The resulting effect is greater achievement, more self-control and a greater level of emotional self-mastery. All of this is achieved without ever trying to change the inner you whilst enhancing confidence, self-mastery, impact and interpersonal effectiveness." ], "next_date" : [ "28th January 2016, Birmingham" ], "title" : [ "Assertiveness without Aggression" ], "url" : "http://medmeetings.co.uktraining/all/assertiveness-without-aggression", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05eca" }, "course_description" : [ "New Course for 2016 - Full details available shortly" ], "next_date" : [ "16th June 2016, London" ], "title" : [ "Brand, Reputation & External Communication" ], "url" : "http://medmeetings.co.uktraining/all/Brand-Reputation ", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ecb" }, "course_description" : [ "CDSL 1 - Understanding the Secure & Successful Service of Today - is designed to ensure that the CD or Service Lead today fully understands the changing context of a service and consequently the true 'job to be done' by an effective lead today. It is not only perfect for aspiring Service or Divisional Leads but also for those with time in post who realise that a new framework is necessary for success today." ], "next_date" : [ "5th February 2016, Manchester" ], "title" : [ "CDSL 1 - Understanding the Secure & Successful Service of Today" ], "url" : "http://medmeetings.co.uktraining/all/CDSL-1", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ecc" }, "course_description" : [ "Leading a Successful Service Today - is designed to ensure that the CD or Service Lead has the knowledge, skills, principles and insight to lead services in extremely difficult and increasingly risky conditions. Anything less than the right approach, applied well, increases service vulnerability by undermining motivation, drive, engagement and morale, as well as resulting in inertia and a failure to achieve, transform or even stabilise." ], "next_date" : [ "10th March 2016, Manchester" ], "title" : [ "CDSL 2 - Leading Successful Services Today" ], "url" : "http://medmeetings.co.uktraining/all/CDSL-2", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ecd" }, "course_description" : [ "Managing a Successful Service Today - is designed to ensure that the CD or Service Lead can successfully keep a service on the straight and narrow, delivering the highest possible quality and experience at the lowest possible cost in a safe environment. This comprehensive day covers the 4 cornerstones of management effectiveness and how to apply them at the service level. It is geared towards managing people and performance in the context of today's tough environment, including how to rectify performance issues should they occur." ], "next_date" : [ "11th March 2016, Manchester" ], "title" : [ "CDSL 3 - Managing Successful Services Today" ], "url" : "http://medmeetings.co.uktraining/all/CDSL-3", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ece" }, "course_description" : [], "title" : [ "Change Management Masterclass " ], "url" : "http://medmeetings.co.ukelearning/all/change_management_masterclass_", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ecf" }, "course_description" : [ "There is so much focus on generic leadership skills that it is all too frequently forgotten that the primary application is in the clinical arena. This programme focuses very specifically on building of intelligent leadership approaches and then applying them to the clinical context. The day as a whole is packed with insight built up into robust models and frameworks, practically applied in cases and clinical scenarios. " ], "next_date" : [ "2nd March 2016, London" ], "title" : [ "Clinical Leadership Excellence " ], "url" : "http://medmeetings.co.uktraining/all/Clinical-Leadership-Excellence", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed0" }, "course_description" : [ "Most people would not even consider taking an exam without acquiring the requisite knowledge, skills and insight in preparation for it and therefore why would you approach perhaps one of the most important events in your life, getting the right consultant job, with any greater uncertainty than there needs to be? You wouldn't. In fact, we know that you'd want to absolutely ensure you stood the best possible chance of success and that is why we have developed the Grow Medical approach to consultant interview success. It's your future and so we don't believe you should take any more chances than necessary.", "This eLearning version of the acclaimed Grow Medical Consultant Interview Skills provides all our skills and knowledge in an easily accessible, user-friendly package. We combine slides, video and audio to create a truly unique eLearning experience guaranteed to improve your chances throughout the whole interview process, and beyond." ], "title" : [ "Consultant Interview Skills" ], "url" : "http://medmeetings.co.ukelearning/all/consultant_interview_skills", "course_duration" : [ "8 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed1" }, "course_description" : [ "Leadership effectiveness is the backbone of successful medicine and successful healthcare. This programme provides a thoroughly comprehensive understanding of the sort of leadership required today, as well as a huge focus on application, whether you are an established consultant or a doctor just getting going in your leadership journey. You'll find it challenging, thought-provoking but above all else, packed with practical and immediately applicable approaches and techniques. " ], "next_date" : [ "22nd March 2016, Manchester" ], "title" : [ "Core Leadership Skills " ], "url" : "http://medmeetings.co.uktraining/all/Core-Leadership-Skills-for-Doctors", "course_duration" : [ "2 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed2" }, "course_description" : [ "Almost all doctors find themselves managing things and it requires the right approach, skills and capability if it is to be straight forward and successful. Our 1-day Core Skills programme is built around the three management contexts of People, Performance & Projects. Of course, these are not separate issues and so we'll develop your insight into how best to approach them concurrently to achieve the highest level of results with the greatest ease. " ], "next_date" : [ "11th April 2016, Manchester" ], "title" : [ "Core Management Skills " ], "url" : "http://medmeetings.co.uktraining/all/Core-Management-Skills-for-Doctors", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed3" }, "course_description" : [ "A raft of practical strategies built into an easy to manage framework that ensures you excel as a consultant, gain the best from your staff and carry yourself with utmost professionalism. This course is designed as an intensive submersion into the key areas necessary to succeed in being an exceptional consultant. Covering everything from new found managerial responsibility to fiscal probity, risk, governance and even the business of health, it acts as a comprehensive framework packed with the practical application of core skills." ], "title" : [ "Core Skills for the Newer Consultant " ], "url" : "http://medmeetings.co.ukelearning/all/core_skills_for_the_newer_consultant_", "course_duration" : [ "8 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed4" }, "course_description" : [ "Audit is a fundamental tool for improving both quality and performance in health and yet many healthcare professionals have never had any formal audit training, often resulting in a loss or dilution of the significant benefits it offers. Commencing with the core skills necessary to run successful audit projects in either the clinical or service domains, we then focus on ensuring that audit results are built successfully into an improvement strategy that delivers consistent attention to factors contributing to results. This course is a highly comprehensive, practical programme designed to equip you with the very best knowledge, skills and ability in this vital competency.", "The course is suitable for anyone who is involved in clinical audit; doctors (both junior and consultant), nurses, PAM and managers and the course content is relevant to all healthcare settings." ], "title" : [ "Core Skills in Clinical & Service Audit" ], "url" : "http://medmeetings.co.ukelearning/all/core_skills_in_clinical_%26_service_audit", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed5" }, "course_description" : [ "A successful service today needs to manage it's reputation, image and  positioning to ensure that it enjoys a healthy flow of the right  patients, thus impacting funding. This intensive course is practical,  fast-paced and covers the critical principles necessary for  effectiveness across the arena of marketing, PR & reputation  management. It is designed to help clinical services to take charge of  their future." ], "title" : [ "Core Skills in Marketing, PR & Reputation Management for Clinical Services" ], "url" : "http://medmeetings.co.ukelearning/all/core_skills_in_marketing%2C_pr_%26_reputation_management_for_clinical_services", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed6" }, "course_description" : [ "With the government committed to a choice agenda, money following the patient through payment by results and GP Commissioners encouraged to increase provider numbers, it is essential that all services get their house in order in this vital area. This course, designed for those taking the lead, comprehensively covers developing a patient experience excellence strategy and implementing it throughout a team, department or even a whole Trust." ], "title" : [ "Core Skills in Patient Experience Excellence" ], "url" : "http://medmeetings.co.ukelearning/all/core_skills_in_patient_experience_excellence", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed7" }, "course_description" : [ "The expectations on modern clinical services are immense against a  backdrop of low morale and increased uncertainty. The service that does  not effectively organise, utilise and manage its workforce is unlikely  to have the capacity, efficiency and drive to produce the sort of  performance that leads to success in the evolving landscape. This highly  practical but immensely powerful programme is designed to help service  leaders, consultants & senior professionals from across healthcare  organise teams for maximum effectiveness with maximum motivation &  morale. Absolutely essential." ], "title" : [ "Core Skills in People Effectiveness for Service Leaders" ], "url" : "http://medmeetings.co.ukelearning/all/core_skills_in_people_effectiveness_for_service_leaders", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed8" }, "course_description" : [ "Effective direction is probably the single most important factor in driving performance and improvement, clinical or otherwise. Whereas it is often viewed as an art, we believe it is more akin to science, with a sound evidence base and known principles. This comprehensive 4 hour course examines all facets of effective direction, providing you with all the knowledge, skills and practical approaches to ensure you gain the greatest possible performance and achievement from your clinical team." ], "title" : [ "Core Skills in Setting Direction" ], "url" : "http://medmeetings.co.ukelearning/all/core_skills_in_setting_direction", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ed9" }, "course_description" : [ "Quite naturally, clinical & service leaders tend to focus on  clinical quality, evolution and innovation. However, an increasingly  competitive market place demands attention to all components of clinical  business excellence if services are to survive and thrive. This  intensive, one-day programme comprehensively covers strategic service  leadership, enabling leaders to balance priorities effectively, whilst  strategically guiding and evolving services so that they may seize  opportunities and mitigate threats." ], "title" : [ "Core Skills in Strategic Effectiveness for Service Leaders" ], "url" : "http://medmeetings.co.ukelearning/all/core_skills_in_strategic_effectiveness_for_service_leaders", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05eda" }, "course_description" : [ "New Course for 2016 - Full details available shortly\r\n" ], "next_date" : [ "20th April 2016, London" ], "title" : [ "Creating Aligned, Shared Vision & Strategic Effectiveness" ], "url" : "http://medmeetings.co.uktraining/all/Creating-Aligned-Shared-Vision", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05edb" }, "course_description" : [ "New Course for 2016 - Full details available shortly" ], "next_date" : [ "21st June 2016, London" ], "title" : [ "Creating Transformation & Leading Successful Change" ], "url" : "http://medmeetings.co.uktraining/all/Creating-Transformation ", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05edc" }, "course_description" : [ "New Course for 2016 - Full details available shortly" ], "next_date" : [ "26th May 2016, London" ], "title" : [ "Designing, Delivering & Optimising the Patient Experience" ], "url" : "http://medmeetings.co.uktraining/all/Designing-Patient-Experience", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05edd" }, "course_description" : [ "The challenges we face, coupled to the complexity of the environment in which we operate, creates some of the most difficult leadership conditions any leader could possibly imagine. Moreover, the cost of leadership failure is catastrophic in human terms. We need leaders who have the personal strength and impact to achieve great things, motivate and inspire people and lead transformation. This programme is focused firmly on you - the leader." ], "next_date" : [ "14th April 2016, London" ], "title" : [ "Developing Exceptional Personal Leadership Impact" ], "url" : "http://medmeetings.co.uktraining/all/Developing-Exceptional-Personal-Leadership-Impact", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ede" }, "course_description" : [ "New Course for 2016 - Full details available shortly" ], "next_date" : [ "25th May 2016, London" ], "title" : [ "Developing the Right Work & Contracts " ], "url" : "http://medmeetings.co.uktraining/all/Developing-the-Right-Work", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05edf" }, "course_description" : [ "Alongside some additional pre-election funding, we have now heard that the largest amount of pledged funding falls far short of the identified shortfall. That means cost improvement is firmly on the agenda. It's vital as pressure increases that we learn how to undertake genuinely effective cost improvement in a manner that preserves and even improves quality & safety. This very practical day is designed to deal with sources of cost improvement, how to set up improvement processes to be safe & effective...." ], "next_date" : [ "27th April 2016, London" ], "title" : [ "Effective & Safe Cost Improvement " ], "url" : "http://medmeetings.co.uktraining/all/Effective-Safe-Cost-Improvement ", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee0" }, "course_description" : [ "The ability to influence or negotiate remains one of the crucial sets of professional capabilities and is frequently the deciding factor in leadership success or failure, business cases, engagement of staff in transformation and the successful function of clinical medicine. Operating without explicit authority, either vertically or horizontally, often in scenarios that have significant implications for the future, means we can't just tell people what to do. It all comes down to the quality of influencing, consensus & negotiation." ], "next_date" : [ "2nd February 2016, London" ], "title" : [ "Effective Influencing & Negotiation Skills " ], "url" : "http://medmeetings.co.uktraining/all/Effective-Influencing", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee1" }, "course_description" : [ "Developed in conjunction with a Senior NHS Finance Director, this course is designed for the many consultants, senior nurses and PAMs who would like NHS finance and business planning demystified to the point of being both understandable and manageable. With particular emphasis on what it takes to be financially successful in today's NHS environment, the course balances a detailed understanding of the principles and process of NHS money flow with the practical skills to operate successfully to ensure services survive and thrive in..." ], "next_date" : [ "29th January 2016, London" ], "title" : [ "Finance & Financial Management " ], "url" : "http://medmeetings.co.uktraining/all/clinical-finance-course", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee2" }, "course_description" : [ "All aspiring doctors are now expected to develop a thorough understanding and application of effective leadership & management principles. Whereas early post-medical school focus is often on acquisition of technical knowledge and skill, the astute Foundation Year Doctor appreciates that by commencing their leadership journey early, they gain an important career advantage and a greater number of opportunities to provide evidence of knowledge and skills acquisition in this area. This powerful course is designed to provide a significant foundation whilst recognising your career stage. Designed to give an insight into the Medical Leadership Competency Framework, jointly developed by The Academy of Medical Royal Colleges and the NHS Institute for Innovation and Improvement, it also provides you with clear guidance on how to go about developing those comptencies throughout your progression. The solid grounding will also be directly beneficial to your achievement ability from this point forward.", "\"Definitely worth it - improves knowledge and understanding. Easy to follow.\"" ], "title" : [ "Foundation Course in Leadership & Management for FY Doctors" ], "url" : "http://medmeetings.co.ukelearning/all/foundation_course_in_leadership_%26_management_for_fy_doctors", "course_duration" : [ "3 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee3" }, "course_description" : [ "There's no question that it's a jungle out there and becoming increasingly difficult to plan just the career you want with any degree of certainty. However, those with the right knowledge, insight and strategy will find themselves with a tremendous ability to influence a future matched closely to their career aspirations. It does mean starting as early as possible and so this very practical e-learning session helps you to plan the last 6 -36 months as a registrar so that you get the best consultant post for you. Using a series of tools you will develop a clear picture of your personal best job, effectively - review where you are now, consider the real gap between where you are now and where you want to be and develop clear goals and action plans to get there. Very powerful stuff." ], "title" : [ "Getting the Right Consultant Post for you " ], "url" : "http://medmeetings.co.ukelearning/all/getting_the_right_consultant_post_for_you_", "course_duration" : [ "2 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee4" }, "course_description" : [ "Our ground-breaking, renowned Insights programme is designed to take individuals from an inadvertent state of naive vulnerability to one of informed insight, allowing you to set a sensible strategic direction, seize opportunity and mitigate the myriad of risk in the emerging system. Going well beyond just information and facts, it provides a deep level of interpretation and insight as to how our new system is likely to play out in reality." ], "next_date" : [ "9th February 2016, Manchester" ], "title" : [ "Insights - Understanding the Evolving Healthcare Landscape" ], "url" : "http://medmeetings.co.uktraining/all/insights", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee5" }, "course_description" : [ "Information that every doctor, nurse, allied professional and manager should know in order to thrive in the evolving system. Our healthcare landscape is changing at a pace that few can keep up with. The evolving system is thick with opportunities, threats, risks and challenges to doctors and services alike. Consequently, it is vital that all doctors are fully aware of the environment in which they operate and what it takes to survive, thrive and drive service success. This hard hitting programme is designed to ensure that healthcare teams fully understand the emerging system, their evolving role and the consequences of being slow to adapt in an increasingly competitive, results driven NHS. Covering everything from payments & funding to community-based healthcare delivery, competition, key challenges and more, you'll find it both enlightening and essential." ], "title" : [ "Insights - Understanding the Evolving Healthcare Landscape" ], "url" : "http://medmeetings.co.ukelearning/all/insights_-_understanding_the_evolving_healthcare_landscape", "course_duration" : [ "5 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee6" }, "course_description" : [ "Given the team nature and complex inter-specialty working of successful healthcare, it is no surprise that efficiency, quality and safety are all so reliant on effective interpersonal interactions. Equally, there is so often a human dynamic component to errors too. Improving interpersonal effectiveness is an investment in better healthcare, improved relationships and a higher quality of working life all round. " ], "next_date" : [ "12th April 2016, Manchester" ], "title" : [ "Interpersonal Skills & Dealing with Difficult People" ], "url" : "http://medmeetings.co.uktraining/all/Dealing-with-Difficult-People", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee7" }, "course_description" : [ "Leadership Masterclass represents the latest thinking in how to drive groups of people to achieve great things. Focusing on both the leadership of self and others, it provides a deep level of insight into current theory and how it can be deployed in the leadership, motivation and influencing of people. At a practical level, it will help you provide strong guidance to people in a wide variety of scenarios from every day working to a sudden crisis. If you are in a leadership role, whether clinical or managerial (or both!), you will find this course immensely useful in helping you achieve your goals, targets and initiatives by providing practical strategies aimed at moving groups, departments or whole organisations in a consistent, aligned direction with maximum motivation." ], "title" : [ "Leadership Fundamentals & Core Principles" ], "url" : "http://medmeetings.co.ukelearning/all/leadership_fundamentals_%26_core_principles", "course_duration" : [ "5 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee8" }, "course_description" : [ "New Course for 2016 - Full details available shortly" ], "next_date" : [ "22nd June 2016, London" ], "title" : [ "Leading & Managing (Championing) Dimensions of Service Success" ], "url" : "http://medmeetings.co.uktraining/all/Leading-Managing-(Championing) ", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ee9" }, "course_description" : [ "Audit has always been a vital part of a robust, well-managed service and yet the combination of audit and improvement has taken on a whole new level of importance in a system that treats poor performance very harshly. This programme is aimed at medical and nursing staff wanting to contribute to the best outcomes for their service by learning how to identify improvement potential and then lead successful improvement work. It will also appeal to trainees wanting to optimise or develop depth in a skill set that ........ " ], "next_date" : [ "3rd February 2016, Manchester" ], "title" : [ "Leading Clinical Audit & Improvement Projects" ], "url" : "http://medmeetings.co.uktraining/all/Leading-Clinical-Audit", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05eea" }, "course_description" : [ "Suddenly in a responsible clinical role you find that all the technical & medical knowledge you've worked hard to gain is only part of the story when managing people. To progress effectively as a doctor it is essential that you develop competency as a manager and this is a key CV requirement for gaining a consultant post. This 4 hour comprehensive course covers all the essential topics in a practical way, to enable you to really develop your management skills in the clinical context.", "\"It`s a great bitesize management course, definitely recommend it.\"", "\"I certainly recommend it.\"" ], "title" : [ "Management Excellence for Junior & Middle Grade Doctors" ], "url" : "http://medmeetings.co.ukelearning/all/management_excellence_for_junior_%26_middle_grade_doctors", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05eeb" }, "course_description" : [ "New Course for 2016 - Full details available shortly " ], "next_date" : [ "17th June 2016, London" ], "title" : [ "Managing Fluctuating Demand" ], "url" : "http://medmeetings.co.uktraining/all/Managing-Fluctuating-Demand", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05eec" }, "course_description" : [ "Healthcare reform to a market environment creates the necessity to engage in active business development in all its forms. The service that stands still could well find itself obsolete or suffering from an erosion of core business without increases elsewhere to compensate. For most clinical teams this is clearly outside of the comfort zone and yet it is essential that the right skills and approaches are adopted to maximise opportunities whilst minimising risk. This comprehensive course covers everything from identification of opportunities, through the actual business development process and onwards to tendering. Practical, innovative and designed to give your service the edge in a competitive landscape." ], "title" : [ "Mastering Business Development, Partnerships & Tenders" ], "url" : "http://medmeetings.co.ukelearning/all/mastering_business_development%2C_partnerships_%26_tenders", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05eed" }, "course_description" : [ "The nature of training and the doctors it produces has altered radically over recent years but in many cases the evolution of how to supervise, manage and get the best from juniors has lagged behind. The challenges arising from more numerous but less experienced juniors, full shift systems, EWTD and more now have the potential to undermine service quality, financial security and competitiveness unless we rethink the management and supervision of doctors in training. This thought-provoking, intensive programme crystallises the issues and presents solutions to some of our most pressing challenges in this area." ], "title" : [ "Optimising the Management & Supervision of Doctors in Training" ], "url" : "http://medmeetings.co.ukelearning/all/optimising_the_management_%26_supervision_of_doctors_in_training", "course_duration" : [ "3 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05eee" }, "course_description" : [ "Designed to set you on a path of development that can literally transform career prospects and healthcare itself, you will find this course packed with the latest leadership and management insights in a practical, modern-day form. There are lots of leadership and management courses available today, some even free. However, what sets this apart is that it provides a really modern, robust foundation for your future growth in a subject area that can be career-defining. " ], "next_date" : [ "26th April 2016, Manchester" ], "title" : [ "Practical Leadership & Management " ], "url" : "http://medmeetings.co.uktraining/all/Practical-Leadership", "course_duration" : [ "2 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05eef" }, "course_description" : [ "Gain the confidence & skills to articulate, excel and inspire in  presentations & teaching. Presentations and teaching skills form one of the  core backbone elements of a successful medical career. Faced with a diverse  range of scenarios, from teaching staff to interview presentations through to a  presentation of an international multicentre trial, it is not surprising that  few have ever received any formal training in this vital area.", "The Academyst Presentation & Teaching Skills Course represents a single,  intensive approach to dealing with the core elements of effectiveness in this  area. It addresses lack of confidence, fear and nerves in order to create a  competent delivery with presence. Planning effectively to put the right content  in that really hits home with the audience. Understanding the psychology of the  audience to take your skills to an advanced level, structuring a wide variety of  presentation and teaching types giving maximum impact and engagement." ], "title" : [ "Presentation & Teaching Skills for Clinical Professionals" ], "url" : "http://medmeetings.co.ukelearning/all/presentation_%26_teaching_skills_for_clinical_professionals", "course_duration" : [ "4 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef0" }, "course_description" : [ "It is true to say that there generally isn't enough time in the day (world's greatest understatement). However, that doesn't alter the responsibilities you have and the importance of the results but it does get in the way of managing most effectively and that is what this advanced programme seeks to address. " ], "next_date" : [ "19th April 2016, London" ], "title" : [ "Rapid Management Effectiveness " ], "url" : "http://medmeetings.co.uktraining/all/Rapid-Management-Effectiveness", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef1" }, "course_description" : [ "New Course for 2016 - Full details available shortly" ], "next_date" : [ "6th July 2016, London" ], "title" : [ "Resolving Complex Problems & Leading Improvement" ], "url" : "http://medmeetings.co.uktraining/all/Resolving-Complex-Problems", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef2" }, "course_description" : [ "New Course for 2016 - Full details available shortly" ], "next_date" : [ "28th June 2016, London" ], "title" : [ "Resolving the Recruitment Crisis from Within" ], "url" : "http://medmeetings.co.uktraining/all/Resolving-Recruitment-Crisis", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef3" }, "course_description" : [ "It's always been true that alongside healthcare's genuinely rewarding nature, it's also one of the most stressful professions too. That's something that is profoundly increasing as the challenges of addressing patient load in a meaningful and supportive manner are undermined by an austere and deeply troubled operational environment. " ], "next_date" : [ "4th February 2016, Manchester" ], "title" : [ "Stress Management & Resilience " ], "url" : "http://medmeetings.co.uktraining/all/Stress-Management-and-Resilience ", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef4" }, "course_description" : [ "A fundamental component of both finance and the business of health in  general is the creation of effective business cases to support activity,  investment, strategy and purchasing decisions. It's a role that every  consultant or clinical leader is called upon to undertake from time to  time. Creating an effective business case has a big impact on your  service. A good one can lead to the right resources and a poor one can  continually be passed over in favour of better presented projects. The  development of skills in this arena can have a massive impact on the  success of your service and your achievement as an individual." ], "title" : [ "The Effective Business Case" ], "url" : "http://medmeetings.co.ukelearning/all/the_effective_business_case", "course_duration" : [ "3 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef5" }, "course_description" : [ "After many requests, we have brought back our renowned New Consultant programme but in a thoroughly updated form. It is designed for consultants in their first few years or even latter year trainees and is designed to ensure that your consultant career is a successful and secure one. The transition from trainee to consultant is perhaps one of the greatest across your career. " ], "next_date" : [ "5th May 2016, London" ], "title" : [ "The New Consultant - Critical Skills, Key Challenges & Ensuring Success (2 Days)" ], "url" : "http://medmeetings.co.uktraining/all/The-New-Consultant", "course_duration" : [ "2 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef6" }, "course_description" : [ "We spend more and more of our time in meetings and yet people often voice that meetings are a complete waste of time. We can change this. The fundamentals of an effective meetings are that it is well organised, runs to time, covers the issues, creates quality decisions, reaches consensus and leads to positive, motivated action by the participants of the meeting. With the right set of skills, processes and strategies this is possible, time and time again. This powerful half-day course will have you running meetings that people look forward to because they achieve." ], "title" : [ "The Productive Meeting" ], "url" : "http://medmeetings.co.ukelearning/all/the_productive_meeting", "course_duration" : [ "2 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef7" }, "course_description" : [ "Designed to make a lasting difference to people's lives, this course is practical, filled with insightful advice about managing load, regaining control, achieving goals more easily and working within today's healthcare. We understand the context of being a senior professional today and can help you achieve at a level you would not think possible. From pre-course assessment to post-course support, it's designed to deliver a transformation." ], "next_date" : [ "26th January 2016, London" ], "title" : [ "Time Management & Personal Effectiveness " ], "url" : "http://medmeetings.co.uktraining/all/time-management", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "GrowMedical" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef8" }, "course_description" : [ "New Course for 2016 - Full details available shortly" ], "next_date" : [ "27th April 2016, London" ], "title" : [ "Understanding & Improving Clinical Efficiency & Productivity" ], "url" : "http://medmeetings.co.uktraining/all/Understanding-Improving-Efficiency", "course_duration" : [ "1 Day Open Course" ], "course_type" : "course_offline", "provider" : [ "Academyst" ] }
{ "_id" : { "$oid" : "56a0008f5a0cb32916d05ef9" }, "course_description" : [ "There's very little we do in life that doesn't rely on the successful interaction of two or more human beings. That is rarely more true than in the delivery of effective clinical care and yet medicine is the ultimate multi-cultural, multi-professional environment. All of this would be inconsequential if we all worked the same way but in truth we are all very different from one person to the next. We make decisions differently, we communicate using different language, we have different preferences and we do things for very different reasons. If you want to be more successful in your interactions with people, whether they are similar or wholly different, this course will provide the bedrock of understanding that will enable you to be more effective.", "\"Very Good Course. Learned a lot!\"" ], "title" : [ "Understanding People" ], "url" : "http://medmeetings.co.ukelearning/all/understanding_people", "course_duration" : [ "3 Hour eLearning Course" ], "course_type" : "online", "provider" : [ "Academyst" ] }
